# Data Frames

In [1]:
import pandas as pd
import numpy as np

In [17]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year' : ['2000', '2001', '2002', '2001', '2002', '2003'],
        'population' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
       }

In [4]:
frame = pd.DataFrame(data)

In [5]:
frame

    state  year  population
0    Ohio  2000         1.5
1    Ohio  2001         1.7
2    Ohio  2002         3.6
3  Nevada  2001         2.4
4  Nevada  2002         2.9
5  Nevada  2003         3.2

In [6]:
frame.head()

    state  year  population
0    Ohio  2000         1.5
1    Ohio  2001         1.7
2    Ohio  2002         3.6
3  Nevada  2001         2.4
4  Nevada  2002         2.9

In [9]:
pd.DataFrame(data, columns=['state', 'year', 'population'])

    state  year  population
0    Ohio  2000         1.5
1    Ohio  2001         1.7
2    Ohio  2002         3.6
3  Nevada  2001         2.4
4  Nevada  2002         2.9
5  Nevada  2003         3.2

# Reindexing

In [18]:
frame2 = pd.DataFrame(data, columns=['state', 'year', 'population'], index=['A', 'B', 'C', 'D', 'E', 'F'])

In [19]:
frame2

    state  year  population
A    Ohio  2000         1.5
B    Ohio  2001         1.7
C    Ohio  2002         3.6
D  Nevada  2001         2.4
E  Nevada  2002         2.9
F  Nevada  2003         3.2

# Retrieve columns

In [16]:
frame2['state']

A      Ohio
B      Ohio
C      Ohio
D    Nevada
E    Nevada
F    Nevada
Name: state, dtype: object

In [17]:
frame2.year

A    2000
B    2001
C    2002
D    2001
E    2002
F    2003
Name: year, dtype: object

In [19]:
frame2[['state', 'year']]

    state  year
A    Ohio  2000
B    Ohio  2001
C    Ohio  2002
D  Nevada  2001
E  Nevada  2002
F  Nevada  2003

# Selection with loc and iloc

In [20]:
frame2.loc['C']

state         Ohio
year          2002
population     3.6
Name: C, dtype: object

In [22]:
frame2.iloc[2]

state         Ohio
year          2002
population     3.6
Name: C, dtype: object

In [31]:
frame2.loc['B','state']

'Ohio'

In [32]:
frame2.loc[['A', 'B'],['state', 'year']]

  state  year
A  Ohio  2000
B  Ohio  2001

# Dropping Entries from an Axis

In [21]:
frame3 = pd.DataFrame(data, columns=['state', 'year', 'population', 'dept'], index=['A', 'B', 'C', 'D', 'E', 'F'])

In [22]:
frame3

    state  year  population dept
A    Ohio  2000         1.5  NaN
B    Ohio  2001         1.7  NaN
C    Ohio  2002         3.6  NaN
D  Nevada  2001         2.4  NaN
E  Nevada  2002         2.9  NaN
F  Nevada  2003         3.2  NaN

In [23]:
frame3.drop('dept', axis=1)

    state  year  population
A    Ohio  2000         1.5
B    Ohio  2001         1.7
C    Ohio  2002         3.6
D  Nevada  2001         2.4
E  Nevada  2002         2.9
F  Nevada  2003         3.2

In [24]:
frame3

    state  year  population dept
A    Ohio  2000         1.5  NaN
B    Ohio  2001         1.7  NaN
C    Ohio  2002         3.6  NaN
D  Nevada  2001         2.4  NaN
E  Nevada  2002         2.9  NaN
F  Nevada  2003         3.2  NaN

In [25]:
frame3.drop('dept', axis=1, inplace=True)

In [11]:
frame3

    state  year  population
A    Ohio  2000         1.5
B    Ohio  2001         1.7
C    Ohio  2002         3.6
D  Nevada  2001         2.4
E  Nevada  2002         2.9
F  Nevada  2003         3.2

# Filtering

In [14]:
frame3['population'] > 1.6

A    False
B     True
C     True
D     True
E     True
F     True
Name: population, dtype: bool

In [37]:
frame3['debt'] = np.arange(6.)

In [38]:
frame3

    state  year  population  debt
A    Ohio  2000         1.5   0.0
B    Ohio  2001         1.7   1.0
C    Ohio  2002         3.6   2.0
D  Nevada  2001         2.4   3.0
E  Nevada  2002         2.9   4.0
F  Nevada  2003         3.2   5.0

In [39]:
frame3[frame3['debt'] > 2]

    state  year  population  debt
D  Nevada  2001         2.4   3.0
E  Nevada  2002         2.9   4.0
F  Nevada  2003         3.2   5.0

In [40]:
frame3[(frame3['debt'] > 2) | (frame3['population'] < 3)]

    state  year  population  debt
A    Ohio  2000         1.5   0.0
B    Ohio  2001         1.7   1.0
D  Nevada  2001         2.4   3.0
E  Nevada  2002         2.9   4.0
F  Nevada  2003         3.2   5.0

In [41]:
frame3[(frame3['debt'] > 2) & (frame3['population'] < 3)]

    state  year  population  debt
D  Nevada  2001         2.4   3.0
E  Nevada  2002         2.9   4.0

In [54]:
frame3[['state','year']][frame3['population'] > 2]

    state  year
C    Ohio  2002
D  Nevada  2001
E  Nevada  2002
F  Nevada  2003

# Aggregation

In [1]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [5]:
frame4 = pd.DataFrame(data);

In [6]:
frame4

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [13]:
by_company = frame4.groupby('Company')

In [14]:
by_company.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [18]:
by_company.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [23]:
by_company.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [25]:
frame4.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [26]:
frame4.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [27]:
frame4.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [28]:
frame4.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [29]:
frame4.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# Merging

In [28]:
student_data = {'id': ['1001', '1002', '1003', '1004', '1005'],
                'name': ['Johnathan Bernal', 'Sioned Allan', 'Cayden Collier', 'Jerome Rudd', 'Jibril Morrow'],
                'section': ['3A', '3A', '3B', '3D', '3E']
               }

In [29]:
grades_data = {
    'id': ['1001', '1002', '1003', '1004', '1005'],
    'math': [91, 85, 86, 83, 75],
    'filipino': [88, 77, 89, 93, 80],
    'science': [92, 87, 85, 82, 78],
    'english': [90, 86, 88, 89, 80]
}

In [30]:
student = pd.DataFrame(student_data)

In [31]:
grade = pd.DataFrame(grades_data)

In [32]:
student_grades = pd.merge(student,grade,how='inner',on='id')

In [33]:
student_grades

     id              name section  math  filipino  science  english
0  1001  Johnathan Bernal      3A    91        88       92       90
1  1002      Sioned Allan      3A    85        77       87       86
2  1003    Cayden Collier      3B    86        89       85       88
3  1004       Jerome Rudd      3D    83        93       82       89
4  1005     Jibril Morrow      3E    75        80       78       80

In [34]:
student_df = pd.DataFrame(student_grades)

In [35]:
student_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        5 non-null      object
 1   name      5 non-null      object
 2   section   5 non-null      object
 3   math      5 non-null      int64
 4   filipino  5 non-null      int64
 5   science   5 non-null      int64
 6   english   5 non-null      int64
dtypes: int64(4), object(3)
memory usage: 320.0+ bytes

In [36]:
student_df['gpa'] = round((((student_df['math'] + student_df['filipino'] + student_df['science']) / 300)*100))

In [37]:
student_df

     id              name section  math  filipino  science  english   gpa
0  1001  Johnathan Bernal      3A    91        88       92       90  90.0
1  1002      Sioned Allan      3A    85        77       87       86  83.0
2  1003    Cayden Collier      3B    86        89       85       88  87.0
3  1004       Jerome Rudd      3D    83        93       82       89  86.0
4  1005     Jibril Morrow      3E    75        80       78       80  78.0

# Function Application

In [43]:
student_df['gpa'].apply(lambda grade: 'Passed' if grade > 75 else 'Failed')

0    Passed
1    Passed
2    Passed
3    Passed
4    Passed
Name: gpa, dtype: object

In [118]:
   def getLetterGrade(grade):
    if grade >= 90 and grade <= 100:
        return "A+"
    elif grade >= 85 and grade <= 89:
        return "A"
    elif grade >= 80 and grade <= 84:
        return "B"
    elif grade >= 77 and grade <= 79:
        return "B+"
    elif grade >= 73 and grade <= 76:
        return "B"
    elif grade >= 70 and grade <= 72:
        return "B-"
    else:
        return 'C+ below'

In [120]:
student_df['grade'] = student_df['gpa'].apply(getLetterGrade)

In [121]:
student_df

,id,name,section,math,filipino,science,english,gpa,remarks,grade
0,1001,Johnathan Bernal,3A,91,88,92,90,90.0,Passed,A+
1,1002,Sioned Allan,3A,85,77,87,86,83.0,Passed,B
2,1003,Cayden Collier,3B,86,89,85,88,87.0,Passed,A
3,1004,Jerome Rudd,3D,83,93,82,89,86.0,Passed,A
4,1005,Jibril Morrow,3E,75,80,78,80,78.0,Passed,B+

# Filtering out missing data

In [2]:
data = pd.DataFrame([[1., 6.5, 3.5],[1., np.nan, np.nan]])

In [3]:
data

     0    1    2
0  1.0  6.5  3.5
1  1.0  NaN  NaN

In [4]:
cleaned = data.dropna()

In [5]:
cleaned

     0    1    2
0  1.0  6.5  3.5

In [15]:
 data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.5
1  1.0  NaN  NaN

In [18]:
data_pop = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year' : ['2000', '2001', '2002', '2001', '2002', '2003'],
        'population' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
       }

In [19]:
data_state = pd.DataFrame(data_pop, columns=['state', 'year', 'population', 'dept'], index=['A', 'B', 'C', 'D', 'E', 'F'])

In [20]:
data_state

    state  year  population dept
A    Ohio  2000         1.5  NaN
B    Ohio  2001         1.7  NaN
C    Ohio  2002         3.6  NaN
D  Nevada  2001         2.4  NaN
E  Nevada  2002         2.9  NaN
F  Nevada  2003         3.2  NaN

In [21]:
data_state.dropna(axis=1, how='all')

    state  year  population
A    Ohio  2000         1.5
B    Ohio  2001         1.7
C    Ohio  2002         3.6
D  Nevada  2001         2.4
E  Nevada  2002         2.9
F  Nevada  2003         3.2

# Removing Duplicates

In [22]:
data_dup = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 
                         'k2': [1, 1, 2, 3, 3, 4, 4]
                        })

In [23]:
data_dup

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [25]:
data_dup.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [26]:
data_dup.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4